# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [ ]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [ ]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [ ]:
df0_i = pd.read_csv("Students_info_0.csv", sep=",", index_col=0)
df1_i = pd.read_csv("Students_info_1.csv", sep=",", index_col=0)
df2_i = pd.read_csv("Students_info_2.csv", sep=",", index_col=0)
df3_i = pd.read_csv("Students_info_3.csv", sep=",", index_col=0)
df4_i = pd.read_csv("Students_info_4.csv", sep=",", index_col=0)
df5_i = pd.read_csv("Students_info_5.csv", sep=",", index_col=0)
df6_i = pd.read_csv("Students_info_6.csv", sep=",", index_col=0)
df7_i = pd.read_csv("Students_info_7.csv", sep=",", index_col=0)
df8_i = pd.read_csv("Students_info_8.csv", sep=",", index_col=0)
df9_i = pd.read_csv("Students_info_9.csv", sep=",", index_col=0)

df0_m = pd.read_csv("Students_marks_0.csv", sep=",", index_col=0)
df1_m = pd.read_csv("Students_marks_1.csv", sep=",", index_col=0)
df2_m = pd.read_csv("Students_marks_2.csv", sep=",", index_col=0)
df3_m = pd.read_csv("Students_marks_3.csv", sep=",", index_col=0)
df4_m = pd.read_csv("Students_marks_4.csv", sep=",", index_col=0)
df5_m = pd.read_csv("Students_marks_5.csv", sep=",", index_col=0)
df6_m = pd.read_csv("Students_marks_6.csv", sep=",", index_col=0)
df7_m = pd.read_csv("Students_marks_7.csv", sep=",", index_col=0)
df8_m = pd.read_csv("Students_marks_8.csv", sep=",", index_col=0)
df9_m = pd.read_csv("Students_marks_9.csv", sep=",", index_col=0)

In [ ]:
df0_i.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
index,,,,,,
0,female,group B,bachelor's degree,standard,none,group1
1,female,group C,some college,standard,completed,group1
2,female,group B,master's degree,standard,none,group1
3,male,group A,associate's degree,free/reduced,none,group1
4,male,group C,some college,standard,none,group1

In [ ]:
df0_m.head()

       math score  reading score  writing score
index
0              72             72             74
1              69             90             88
2              90             95             93
3              47             57             44
4              76             78             75

In [ ]:
df0 = pd.concat([df0_i, df1_i, df2_i, df3_i, df4_i, df5_i, df6_i, df7_i, df8_i, df9_i])

In [ ]:
df0

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
index,,,,,,
0,female,group B,bachelor's degree,standard,none,group1
1,female,group C,some college,standard,completed,group1
2,female,group B,master's degree,standard,none,group1
3,male,group A,associate's degree,free/reduced,none,group1
4,male,group C,some college,standard,none,group1
...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10
996,male,group C,high school,free/reduced,none,group10
997,female,group C,high school,free/reduced,completed,group10
998,female,group D,some college,standard,completed,group10
999,female,group D,some college,free/reduced,none,group10

In [ ]:
df1 = pd.concat([df0_m, df1_m, df2_m, df3_m, df4_m, df5_m, df6_m, df7_m, df8_m, df9_m])

In [ ]:
df1

       math score  reading score  writing score
index
0              72             72             74
1              69             90             88
2              90             95             93
3              47             57             44
4              76             78             75
...           ...            ...            ...
995            88             99             95
996            62             55             55
997            59             71             65
998            68             78             77
999            77             86             86

[1000 rows x 3 columns]

In [ ]:
df = pd.concat([df0, df1], axis=1)

In [ ]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
index,,,,,,,,,
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [ ]:
df = df.reset_index(drop=True)

In [ ]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [ ]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [ ]:
df["math score"].min(), df["math score"].max(),  df["math score"].mean(),  df["math score"].var()

(0, 100, 66.089, 229.91899799799847)

In [ ]:
df["reading score"].min(), df["reading score"].max(),  df["reading score"].mean(),  df["reading score"].var()

(17, 100, 69.169, 213.1656046046047)

In [ ]:
df["writing score"].min(), df["writing score"].max(),  df["writing score"].mean(),  df["writing score"].var()

(10, 100, 68.054, 230.90799199199168)

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [ ]:
df.isna().any().any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [ ]:
df["math score"].mean()

66.089

In [ ]:
df["reading score"].mean()

69.169

In [ ]:
df["writing score"].mean()

68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [ ]:
df.loc[df["test preparation course"]=="completed", "math score"].mean()

69.69553072625699

In [ ]:
df.loc[df["test preparation course"]=="none", "math score"].mean()

64.0778816199377

In [ ]:
df.loc[df["test preparation course"]=="completed", "reading score"].mean()

73.89385474860335

In [ ]:
df.loc[df["test preparation course"]=="none", "reading score"].mean()

66.53426791277259

In [ ]:
df.loc[df["test preparation course"]=="completed", "writing score"].mean()

74.41899441340782

In [ ]:
df.loc[df["test preparation course"]=="none", "writing score"].mean()

64.50467289719626

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [ ]:
df["lunch"].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [ ]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

In [ ]:
df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,88,99,95
996,male,group C,high school,free/reduced,none,group10,62,55,55
997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,female,group D,some college,standard,completed,group10,68,78,77
999,female,group D,some college,free/reduced,none,group10,77,86,86

**Зафиксируем минимальный балл для сдачи экзамена**

In [ ]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [ ]:
len(df.loc[df["math score"]>=50, "math score"])/len(df)

0.865

In [ ]:
len(df.loc[(df["math score"]>=50) & (df["test preparation"]=="completed"), "math score"])/len(df)

0.33

In [ ]:
len(df.loc[(df["math score"]<50) & (df["test preparation"]=="none") & (df["gender"]=="female"), "math score"])/len(df)

0.07

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [ ]:
gr1 = df.groupby(by="race/ethnicity")

In [ ]:
gr1["reading score"].mean()

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [ ]:
import time

start = time.time()

gr1 = df.groupby(by="race/ethnicity")
gr1["reading score"].mean()

end = time.time() - start

print(end)

0.003000020980834961

In [ ]:
gr2 = df.groupby(by="education")

In [ ]:
gr2["writing score"].min()

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

In [ ]:

start = time.time()

gr2 = df.groupby(by="education")
gr2["writing score"].min()

end = time.time() - start

print(end)

0.0030012130737304688

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [ ]:
start = time.time()

score_A = 0
score_B = 0
score_C = 0
score_D = 0
score_E = 0
col_A = 0
col_B = 0
col_C = 0
col_D = 0
col_E = 0
for i in range(len(df)):
    if df["race/ethnicity"][i]=="group A":
        score_A += df["reading score"][i]
        col_A +=1
    elif df["race/ethnicity"][i]=="group B":
        score_B +=df["reading score"][i]
        col_B+=1
    elif df["race/ethnicity"][i]=="group C":
        score_C+= df["reading score"][i]
        col_C+=1
    elif df["race/ethnicity"][i]=="group D":
        score_D+= df["reading score"][i]
        col_D+=1
    else:
        score_E+= df["reading score"][i]
        col_E+=1
print(score_A/col_A)
print(score_B/col_B)
print(score_C/col_C)
print(score_D/col_D)
print(score_E/col_E)

end = time.time() - start

print(end)

64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
0.031002044677734375

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [ ]:
grouped = pd.pivot_table(df, index=["gender", "education"], aggfunc=np.mean)
grouped

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [ ]:
def fun(score):
    res = "F" if score < 50 else "P"
    return res


df["Math_PassStatus"] = df["math score"].apply(fun)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P
1,female,group C,some college,standard,completed,group1,69,90,88,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F
4,male,group C,some college,standard,none,group1,76,78,75,P

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [ ]:
def f(row):
    if row["math score"]<50 or row["reading score"]<50 or row["writing score"]<50:
        val = "F"
    else:
        val = "P"
    return val

df['OverAll_PassStatus'] = df.apply(f, axis=1)

In [ ]:
df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,88,99,95,P,P
996,male,group C,high school,free/reduced,none,group10,62,55,55,P,P
997,female,group C,high school,free/reduced,completed,group10,59,71,65,P,P
998,female,group D,some college,standard,completed,group10,68,78,77,P,P
999,female,group D,some college,free/reduced,none,group10,77,86,86,P,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [ ]:
def GetGrade(ds):
    average_mark = (ds["math score"]+ds["reading score"]+ds["writing score"])/3
    if average_mark > 90:
        grade = "A"
    elif 80 < average_mark <=90:
        grade = "B"
    elif 70 < average_mark <=80:
        grade = "C"
    elif 60 < average_mark <=70:
        grade = "D"
    elif 50 < average_mark <=60:
        grade = "C"
    else:
        grade = "F (Fail)"
    return grade
df["Grade"]=df.apply(GetGrade, axis=1)

In [ ]:
df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,OverAll_PassStatus,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,C
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,B
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,F,F (Fail)
4,male,group C,some college,standard,none,group1,76,78,75,P,P,C
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,88,99,95,P,P,A
996,male,group C,high school,free/reduced,none,group10,62,55,55,P,P,C
997,female,group C,high school,free/reduced,completed,group10,59,71,65,P,P,D
998,female,group D,some college,standard,completed,group10,68,78,77,P,P,C
999,female,group D,some college,free/reduced,none,group10,77,86,86,P,P,B